Revit 2027 API
ParameterTypeId.SpaceLightingScheduleParam Property
 "Lighting Schedule"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SpaceLightingScheduleParam { get; }
Public Shared ReadOnly Property SpaceLightingScheduleParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SpaceLightingScheduleParam {
	ForgeTypeId^ get ();
}
static member SpaceLightingScheduleParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace